{
  "legal_terms": [
    {
      "term": "Affidavit",
      "meaning": "A written statement made under oath, used as evidence in court."
    },
    {
      "term": "Alimony",
      "meaning": "A legal obligation to provide financial support to a spouse after separation or divorce."
    },
    {
      "term": "Arbitration",
      "meaning": "A method of resolving disputes outside of court, where a neutral third party makes a binding decision."
    },
    {
      "term": "Breach of Contract",
      "meaning": "The failure to perform any term of a contract, including expiring deadlines."
    },
    {
      "term": "Burden of Proof",
      "meaning": "The obligation to prove one's assertion or claim in a legal proceeding."
    },
    {
      "term": "Class Action",
      "meaning": "A lawsuit filed by one or more plaintiffs on behalf of a larger group of people."
    },
    {
      "term": "Damages",
      "meaning": "Monetary compensation awarded to a party for loss or injury due to the actions of another party."
    },
    {
      "term": "Defendant",
      "meaning": "An individual or entity accused of a crime or being sued in a court of law."
    },
    {
      "term": "Deposition",
      "meaning": "A formal statement taken under oath, often used in the discovery phase of litigation."
    },
    {
      "term": "Due Process",
      "meaning": "The legal requirement that the state must respect all legal rights owed to a person."
    },
    {
      "term": "Injunction",
      "meaning": "A court order that requires a party to do or refrain from doing a specific act."
    },
    {
      "term": "Jurisdiction",
      "meaning": "The official power of a court to make legal decisions and judgments."
    },
    {
      "term": "Liability",
      "meaning": "Legal responsibility for one's actions or omissions that may cause harm to another."
    },
    {
      "term": "Litigation",
      "meaning": "The process of taking legal action or resolving disputes in court."
    },
    {
      "term": "Plaintiff",
      "meaning": "The person or party who initiates a lawsuit."
    },
    {
      "term": "Probate",
      "meaning": "The legal process of validating a deceased person's will and distributing their estate."
    },
    {
      "term": "Subpoena",
      "meaning": "A legal document ordering an individual to testify or produce evidence in a legal proceeding."
    },
    {
      "term": "Tort",
      "meaning": "A wrongful act or infringement of a right leading to civil legal liability."
    },
    {
      "term": "Verdict",
      "meaning": "The decision made by a jury or judge on the matters of fact in a case."
    },
    {
      "term": "Panchayat",
      "meaning": "A local self-government system in rural areas of India, consisting of elected members who resolve disputes."
    },
    {
      "term": "Learned counsel",
      "meaning": "A term used to refer to a lawyer or advocate who is knowledgeable and experienced in legal matters."
    },
    {
      "term": "Stay Order",
      "meaning": "A court order to temporarily stop a legal proceeding or the enforcement of a judgment."
    },
    {
      "term": "Sarpanch",
      "meaning": "The head of a Panchayat, responsible for making decisions and leading the local governing body."
    },
    {
      "term": "Nyaya Panchayat",
      "meaning": "A system of local justice in rural areas of India that adjudicates minor disputes."
    },
    {
      "term": "Order Sheet",
      "meaning": "A formal record maintained by the court that outlines the proceedings and orders given during a case."
    },
    {
      "term": "Verification",
      "meaning": "The process of confirming the accuracy or truth of a document or statement."
    },
    {
      "term": "Inadmissible Evidence",
      "meaning": "Evidence that cannot be considered by a judge or jury in a court of law due to legal rules."
    },
    {
      "term": "Mukarrari Lease",
      "meaning": "A type of lease in India, particularly in coal mining, granting rights for coal extraction on a specific piece of land."
    },
    {
      "term": "Encroachment",
      "meaning": "The act of intruding on someone else's property or rights, especially in the context of land or resources."
    },
    {
      "term": "Coal Mining Rights",
      "meaning": "Legal rights granted to individuals or companies to extract coal from a specified area."
    },
    {
      "term": "Subordinate Judge",
      "meaning": "A judicial officer in a lower court who has jurisdiction over certain types of cases."
    },
    {
        "term": "Permanent Injunction",
        "meaning": "A court order requiring a party to do or refrain from doing specific acts permanently."
    },
    {
        "term": "Limitation Act",
        "meaning": "A law that sets the maximum time period within which legal proceedings must be initiated."
    },
    {
        "term": "Conversion",
        "meaning": "An unlawful act of taking someone else's property and treating it as one's own."
    },
    {
        "term": "Joint Workings",
        "meaning": "Collaborative operations involving two or more parties, particularly in extracting resources like coal."
    },
    {
        "term": "Possession",
        "meaning": "The state of having, owning, or controlling something, often used in legal contexts to establish rights to property."
    },
    {
        "term": "Statutory Period",
        "meaning": "A legally defined time frame within which certain legal actions must be taken."
    },
    {
        "term": "Seam",
        "meaning": "A layer of coal or other mineral in a mine."
    }
  ]
}
